<?php

namespace Database\Seeders;
use App\Models\Messages;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class MassageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Messages::create([
            'messager_name'  => 'Sam K. Burns',
            'messager_designation'  => 'Chairman',
            'title'  => 'সভাপতির বাণী',
            'content'=> 'শিক্ষা শুধু জীবন প্রস্তুতির উপায় নয়, তা জীবন-যাপনের প্রণালীও বটে। শিক্ষাকে জীবনব্যাপি অনুসরণীয় প্রক্রিয়া হিসেবে দেখতে হবে এবং অভিজ্ঞতাকে শিক্ষা লাভের স্বাভাবিক কৌশল হিসেবে বিবেচনায় রাখতে হবে..',
            'slug'   => 'chairman-message',
            'image'  => 'Chairman-1671265583-1672663010.jpg',
            'status' => '1',
           ]);
        Messages::create([
            'messager_name'  => 'Sam K. Burns',
            'messager_designation'  => 'Principal',
            'title'  => 'প্রতিষ্ঠান প্রধানের বাণী',
            'content'=> 'স্কুলের লক্ষ্য ও উদ্দেশ্য হচ্ছে সুপরিকল্পিত পাঠ্যক্রম,  সহ–পাঠ্যক্রম কর্মসূচির যথাযথ বাস্তবায়নের মাধ্যমে ছাত্রদের শারীরিক ও মানসিক গুণাবলীর সর্বোচ্চ উৎকর্ষ সাধন যাতে তারা সুনাগরিক হিসেবে গড়ে উঠতে পারে এবং ভবিষ্যতে দেশ ও ...',
            'slug'   => 'principal-message',
            'image'  => 'headmaster-1672663078.jpg',
            'status' => '1',
           ]);
        Messages::create([
            'messager_name'  => 'About Institute',
            'messager_designation'  => 'Institute',
            'title'  => 'প্রতিষ্ঠান সম্পর্কে',
            'content'=> 'বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ',
            'slug'   => 'history',
            'image'  => 'institute-1672663130.jpg',
            'status' => '1',
           ]);
    }
}
