@extends('frontent.theme1.layouts.web')

@section('content')



<!-- ---------------------------------------------------------------------------------------------------------------------------------------------------  
    START SchoolHistory PART
--------------------------------------------------------------------------------------------------------------------------------------------------- -->
<section class="AtAGlance section_gaps">

    <div class="container">

        <div class="row">

            <div class="col-lg-12">

                <div class="AtAGlanceContent">

                    <h3>Why Study</h3>

                    <p>বিএএফ শাহীন কলেজ ঢাকার ইতিহাস বিএএফ শাহীন কলেজ ঢাকা (BAF Shaheen College Dhaka) দেশের অন্যতম প্রসিদ্ধ শিক্ষা প্রতিষ্ঠান। ১ মার্চ ১৯৬০ সালে প্রতিষ্ঠানটি “শাহীন স্কুল” নামে ইংরেজি মাধ্যমে স্কুল হিসেবে যাত্রা শুরু করে। পরবর্তীতে ১৯৬৭ সালে ইংরেজি মাধ্যমের পাশাপাশি বাংলা মাধ্যম চালু করা হয়। এরই মধ্যে শাহীন স্কুলকে “শাহীন উচ্চবিদ্যালয়” হিসেবে নামকরণ করা হয় এবং কয়েক বছরের মধ্যেই উচ্চমাধ্যমিক শিক্ষা বোর্ড ঢাকা কর্তৃক স্বীকৃতি পায়। ১৯৭৭-৭৮ শিক্ষাবর্ষে শাহীন উচ্চবিদ্যালয়কে উচ্চমাধ্যমিক মহাবিদ্যালয়ে উন্নীত করার উদ্দেশ্যে “বিএএফ শাহীন কলেজ ঢাকা” নামকরণ করা হয়। ১৯৯০-৯১ শিক্ষাবর্ষে ডিগ্রি (পাস কোর্স) চালু করা হয় এবং তখন থেকে বিএএফ শাহীন কলেজ একটি ডিগ্রি কলেজ হিসেবে কার্যক্রম চালিয়ে যাচ্ছে। তবে ২০০৬-০৭ শিক্ষাবর্ষ থেকে ডিগ্রি অবলুপ্ত করা হয়। বর্তমানে কলেজটি প্রাথমিক শিক্ষা অধিদপ্তর, মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা অধিদপ্তর এবং মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ডের নিয়মানুযায়ী শিশু শ্রেণি হতে দ্বাদশ শ্রেণি পর্যন্ত শিক্ষা কার্যক্রম পরিচালনা করা হয়। এখানে সহপাঠ কার্যক্রম চালু আছে। কলেজটি শিক্ষা পদ্ধতি ও শৃঙ্খলার জন্য সুপরিচিত ও সুপ্রতিষ্ঠিত। ২০০৬ শিক্ষাবর্ষে জাতীয় শিক্ষাক্রম ও টেক্সটবুক বোর্ডের শিক্ষানীতি অনুযায়ী বাংলা মাধ্যমের পাশাপাশি ইংরেজি মাধ্যম চালু করা হয়। দীর্ঘ পাঁচ দশকেরও বেশি সময় ধরে প্রতিষ্ঠানটি বহু প্রতিভার জন্ম দিয়েছে যাঁরা জাতীয় ও আন্তর্জাতিক পর্যায়ে স্বনামধন্য হয়েছেন। গ্রুপ ক্যাপ্টেন ভোগার ছিলেন তৎকালীন পাকিস্তান বিমানবাহিনীর ঘাঁটি অফিসার-ইন-কমান্ড এবং একইসাথে সিভিল এভিয়েশনের ভারপ্রাপ্ত কর্মকর্তা। সেই সময় পাকিস্তান বিমানবাহিনী, সেনাবহিনী, সিভিল এভিয়েশন এবং PIA(Pakistan International Airlines) এর সকল কর্মকর্তা-কর্মচারী ছিলেন পশ্চিম পাকিস্তানী ও উর্দু ভাষাভাষী। তাই ঢাকায় বিমানবাহিনীর কর্মকর্তা-কর্মচারীবৃন্দের সন্তানদের শিক্ষা সমস্যা দূর করার লক্ষ্যে ইংরেজি মাধ্যম স্কুলের প্রয়োজনীয়তা সকলেই অনুভব করলেন। ফ্লাইট লেফটেন্যান্ট (শিক্ষা পরিদপ্তর) এজেএম খলিল উল্লাহ, যিনি পরবর্তীতে ইংল্যান্ডের লিংকন’স ইন হতে ব্যারিস্টার-এট-ল ডিগ্রি অর্জন করে ব্যারিস্টার খলিল উল্লাহ নামে অধিক সমাদৃত হন; স্কুলের প্রতিষ্ঠাতা সভাপতি হিসেবে নিয়োগ পান। স্কুল প্রতিষ্ঠার এই কাজটি ছিল অত্যান্ত সাহসী পদক্ষেপ। এই পর্যায়ে স্কুলটির একটি সার্থক নাম নিয়ে বিপদে পড়তে হয়। অবশেষে সার্জেন্ট জাকারিয়া এগিয়ে এলেন একটি উপযুক্ত নাম নিয়ে। তিনি শাহীন নামটির প্রস্তাব দিলেন এবং তা সাথে সাথে গ্রহণযোগ্যতা পেল। “শাহীন” একটি উর্দু শব্দ যার অর্থ হচ্ছে ঈগল, যা বিমানবাহিনীর সাথে অত্যান্ত সামঞ্জস্যপূর্ণ। স্কুল পরিচালনার অর্থ যোগান ও ভবন নির্মাণের বিষয়ে বিভিন্ন পরিকল্পনা, পর্যালোচনা চলল। আর এই সব পরিকল্পনা নিবেদিত প্রাণ ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলাউল্লাহ যোগ্য নেতৃত্বে বাস্তবে রূপ নিল। যদিও প্রাথমিকভাবে স্কুলটি বিমানবাহিনীর কর্মকর্তা-কর্মচারীদের সন্তানদের জন্য প্রতিষ্ঠা করা হয়েছিল; পরবর্তীতে তা বেসামরিক বিভিন্ন শ্রেণি-পেশার সন্তানদের জন্যও চালু করা হয়। এস. এ. আহমেদ ছিলেন স্কুলের প্রথম অধ্যক্ষ। স্কুলটি মাত্র ৩৪জন শিক্ষার্থী নিয়ে যাত্রা শুরু করে। স্কুল ভবন হিসেবে প্রথমে স্কোয়াশ কোর্ট ও পরবর্তীতে সার্জেন্ট মেস, ক্যাম্প মসজিদ ও রাডার ভবনকে ব্যবহার করা হয়। সিভিল এভিয়েশনের সম্প্রচার কক্ষকে অধ্যক্ষের কার্যালয় হিসেবে ব্যবহারের সুবিধা দেয়া হয়। ইতিমধ্যে প্রতিরক্ষা মন্ত্রণালয় বর্তমান স্কুল ভবনের জমিটি স্কুল কর্তৃপক্ষের জন্য বরাদ্দ দেয়। এভাবেই ১ মার্চ ১৯৬০ সালের এক সকালে গ্রুপ ক্যাপ্টেন ভোগার এবং ফ্লাইট লেফটেন্যান্ট এ. জে. এম খলিলউল্লাহ যে ছোট্ট স্বপ্ন দেখেছিলেন তা আজ এক মাইলফলকে রূপান্তরিত হয়েছে। স্বাধীনতা পরবর্তী সময়ে বাংলাদেশ বিমানবাহিনী স্কুলটিকে নতুনভাবে গড়ে তোলেন। এদিকে ধীরে ধীরে ছাত্র-ছাত্রীর সংখ্যা বাড়তে থাকে।১৯৯৪-৯৮ সালের মধ্যে দু’টি তিনতলা কলেজ ভবন নির্মিত হয়। ২০০২-০৫ সালে নির্মিত হয় কলেজ অডিটোরিয়াম শাহীন হল। তাছাড়া নিরবিচ্ছিন্ন বিদ্যুৎ এবং পানি সরবরাহ নিশ্চিত করার লক্ষ্যে কলেজের নিজস্ব জেনারেটর এবং গভীর নলকূপ স্থাপন করা হয়েছে। এসকল অর্জন সম্ভব হয়েছে বিমানবাহিনী কর্তৃপক্ষের সুনিপুণ পরিকল্পনা ও দূরদৃষ্টির জন্য। ১৯৬০ সাল থেকে অদ্যবধি প্রতিষ্ঠানের জন্য অধ্যক্ষবৃন্দ, উপাধ্যক্ষবৃন্দ, শিক্ষক-শিক্ষিকা ও কর্মকর্তা-কর্মচারিগণের অবদান, ত্যাগ ও সহযোগিতা স্কুলের ইতিহাসে চিরভাস্কর হয়ে থাকবে।</p>

                </div>

            </div>

        </div>

    </div>

</section>



<!-- ---------------------------------------------------------------------------------------------------------------------------------------------------  
    START Footer PART
--------------------------------------------------------------------------------------------------------------------------------------------------- -->
@endsection